[
  {
    "code": "MBCH08014",
    "name": "HCP-Med: Foundations of Medicine 1",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch08014.htm",
    "availability": "SS1",
    "period": "Full Year",
    "credits": "90",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 8 (Year 1 Undergraduate)",
    "scqf_credits": "90",
    "summary": "HCP-Med: Foundations of Medicine 1 is the first of two, year-long courses, both of which (a) contribute to a comprehensive foundation in biomedical, social and clinical sciences and (b) link that knowledge to clinical practice.  It comprises three biomedical modules, which address aspects of human functioning.  Alongside the biomedical modules, social and ethical aspects of medicine are taught - that teaching emphasises the importance of understanding health and illness from a holistic, biopsychosocial perspective.  Themes from the biomedical and socio-ethical modules are used as examples to teach evidence-based medicine and professional skills.  During a longitudinal general practice placement, students will be encouraged to link their theoretical learning to their clinical experience.",
    "course_description": "1) Academic DescriptionOn completion of HCP-Med: Foundations of Medicine 1, students will have acquired a broad knowledge of biomedical and social sciences and will begin to appreciate their relevance to clinical medicine.The course comprises three biomedical modules, each of which covers scientific and clinical dimensions of human functioning: 'Body in Motion' concentrates on the locomotor and respiratory systems and covers relevant anatomy and physiology as well as the principles of pharmacology; 'Sustaining Life' focuses on the cardiovascular system, nutrition and digestion, and includes teaching on the structure and functions of blood; 'Integrity' covers homeostasis, immunology and cancer.  The longitudinal 'parallel' module 'Knowledge to Clinical Practice' (KCP) integrates those topics, and make links with socio-ethical themes, evidence-based medicine and professional skills.The course will prepare students for 'HCP-Med: Foundations of Medicine 2', which addresses new biomedical topics and develops further learning in social and ethical aspects of medicine and professional skills.Taken together, HCP-Med: Foundations of Medicine 1 and 2 prepare the student for HCP-Med: Introduction to Clinical Practice, which is taught in Year 3 of the HCP-Med programme.2) Outline ContentThe course comprises three biomedical 'block' modules as described above.  In addition, five longitudinal modules run throughout the course:(i) 'Social and Ethical Approaches to Medicine' (SEAM), which covers the social patterning of ill health, the experience of health and illness, ethical aspects of medicine and public health;(ii) 'Research and Evidence-Based Medicine' (REBM), which will equip students with the skills needed for critical appraisal of scientific research and its application to clinical scenarios;(iii) 'Knowledge to Clinical Practice' (KCP), is mainly taught in general practice and emphasises the relevance of scientific and clinical knowledge to clinical practice.  For example, alongside 'Body in Motion', KCP will include case-studies of common disorders of the locomotor system, such as osteoarthritis;(iv)'Professional Skills', which includes communication skills, clinical skills and professionalism; and(iv) 'Student Selected Component' (SSC) in which students will complete audit project.3) Student Learning ExperienceHCP-Med: Foundations of Medicine 1 consists of 40 weeks of teaching.  Three weeks are residential in Edinburgh and each residential week involves 41 hours of student effort.  The remaining 37 weeks are taught online and in GP placements, and each of those weeks demands 21 hours of student effort.Online teaching has two broad aims: (i) to present high quality resources which engage and challenge students and (ii) to create and support a community of learning.Online teaching methods include:- A video introduction, which will include the module's learning outcomes- Pre-recorded narrated lectures covering the main learning points- Online quizzes- Virtual tutorials using problem-based or case-based learning- Curated online resourcesGeneral practice placements will use a variety of teaching methods:(i) apprentice-style observation of surgeries, which will provide early exposure to a wide range of clinical cases relevant to the online curriculum;(ii) tutorials covering aspects of professional knowledge, skills and behaviours to complement online teaching; and(iii) shadowing members of the primary care team.Residential weeks will include lectures, tutorials, group-work, workshops for communication skills and clinical skills, and practical demonstrations.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "academic_year": "Quota:  25",
    "course_start": "Full Year",
    "learning_activities": "Total Hours: 900 ( Programme Level Learning and Teaching Hours 18, Directed Learning and Independent Learning Hours 882 )",
    "assessment": {
      "written_exam_percent": 65,
      "coursework_percent": 35,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n65 %,\nCoursework\n35 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n65 %,\nCoursework\n35 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Written Exam: 65%, Coursework: 35%",
    "assessment_methods": "Written Exam\n65 %,\nCoursework\n35 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "As a scholar and scientist:  On completion of HCP-Med: Foundations of Medicine 1, the student will be able to demonstrate an understanding of the principles of biomedical science (particularly relating to the locomotor, cardiovascular and respiratory systems, and including the principles of pharmacology),  social sciences and ethics relevant  to medicine.  They will be able to apply those principles to clinical scenarios.As a practitioner:  On completion of HCP-Med: Foundations of Medicine 1 the student will be able to demonstrate basic clinical skills such as communicating with patients, applying judgement to clinical scenarios, using knowledge of biomedical and social science and ethics.  The student will have acquired specific practical skills such as first aid and measurement of blood pressure. The student will also demonstrate an ability to share academic and clinical information using information technology.As a professional:  On completion of HCP-Med: Foundations of Medicine 1, the student will be able to plan their personal learning with reference to learning outcomes and guidance from tutors. They will be able to demonstrate an understanding of the ethical, professional and legal responsibilities of medical students and doctors, participate successfully in Problem Based Learning (PBL) groups, and attend to personal health, wellbeing and professional development.",
    "keywords": "medicine,medical ethics,human physiology,human anatomy,medical sociology,evidence-based medicine",
    "course_organiser": "Dr Jen KennedyTel:Email:Jen.Kennedy@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MBCH08011",
    "name": "Molecules to Society 1a",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch08011.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "50",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 8 (Year 1 Undergraduate)",
    "scqf_credits": "50",
    "summary": "The course provides an introduction to the breadth of biological, social and clinical sciences particularly by organ systems. The course maintains a holistic and patient-centred perspective together with a professional and ethical understanding. The course is made up of three principal strands which are co-ordinated and integrated by problem-based learning scenarios. The course will include some biomedical science, behavioural and psychosocial science (which are the two major strands) and clinical science, but to varying proportions. The interrelationship of biological, psychological and social factors in the causation of disease and on the ability of patients to be cured of or to live with the disease will be demonstrated and serve to emphasize that all learning is relevant to the practice of medicine. There will be some early patient contact.",
    "course_description": "Not entered",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "graduate_attributes_and_skills": "Not entered",
    "additional_class_delivery_information": "The normal weekly timetable provides for approximately 10 hours lectures, 5 hours practicals, 3 hours problem based learning and 2 hours tutorials, and 3 hours directed private study.",
    "keywords": "Not entered",
    "course_organiser": "Dr Robert GrayTel:(0131) 242 6654Email:R.D.Gray@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH08010",
    "name": "Molecules to Society 1b",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch08010.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "50",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 8 (Year 1 Undergraduate)",
    "scqf_credits": "50",
    "summary": "The course provides an introduction to the breadth of biological, social and clinical sciences particularly by organ systems. The course maintains a holistic and patient-centred perspective ?together with a professional and ethical understanding. The course is made up of three principal strands which are co-ordinated and integrated by problem-based learning scenarios, through three modules (Cardiac health, respiration and bones and joints). Each module will include some biomedical science, behavioural and psychosocial science (which are the two major strands) and clinical science, but to varying proportions. The theme of each module will usually be the problems of a patient with disease of a particular organ system. The interrelationship of biological, psychological and social factors in the causation of disease and on the ability of patients to be cured of or to live with the disease will be demonstrated and serve to emphasize that all learning is relevant to the practice of medicine. There will be some early patient contact.",
    "course_description": "Not entered",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "graduate_attributes_and_skills": "Not entered",
    "additional_class_delivery_information": "The normal weekly timetable provides for approximately 10 hours lectures, 5 hours practicals, 3 hours problem based learning and 2 hours tutorials, and 3 hours directed private study.",
    "keywords": "Not entered",
    "course_organiser": "Dr Robert GrayTel:(0131) 242 6654Email:R.D.Gray@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH08006",
    "name": "Student Selected Component 1",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch08006.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "20",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 8 (Year 1 Undergraduate)",
    "scqf_credits": "20",
    "summary": "A student selected Clinical Options Project (COP) will be undertaken in small groups with the help of a tutor.  The group decides how to tackle the problem, investigate it and deliver an answer in the form of a poster presentation.",
    "course_description": "Not entered",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "graduate_attributes_and_skills": "Not entered",
    "additional_class_delivery_information": "The students are split inot three equal cohorts and the course is delivered 3 times a week on Tuesday afternoon, Wednesday afternoon and Thursday morning.",
    "keywords": "Not entered",
    "course_organiser": "Mr Euan ThomsonTel:Email:",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MBCH08013",
    "name": "Whole body health 1",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch08013.htm",
    "availability": "SS1",
    "period": "Full Year",
    "credits": "120",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 8 (Year 1 Undergraduate)",
    "scqf_credits": "120",
    "summary": "Year 1 of the MBChB programme will provide you with an understanding of health, disease and wellbeing and how these are affected by society and the wider environment. The course will give an understanding of research methods and interpretation of scientific information. This knowledge will be integrated with common diseases and will also introduce core professional values and ethical principles.",
    "course_description": "The course will cover Body in Motion, Sustaining Life, Integrity and Principals of Pharmacology. This knowledge will be integrated with clinical practice.Socio-ethical Aspects of Medicine (SEAM) will cover social determinants of illness, meaning of illness, experience of illness, medical ethics, public health and health improvement.Research and Evidence Based Medicine (REBM) will cover understanding information, the role of evidence-based medicine, hypothesis driven and hypothesis free research, types of data, evaluating interventions, critical appraisal and communication of research.Professional Skills will cover importance of communication, empathy, compassion and wellbeing.The course content is delivered through lectures, seminars, tutorials, online resources and in person sessions. Clinical and communication skills sessions and Problem Based Learning will also be used to explore more deeply both knowledge and approach to learning. You will also undertake community based practicals.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "additional_costs": "Travel to community placements will be required. The Medical School provides a small subsidy to help with these costs but they do not cover the full expenditure. Students will also need access to a smart device or laptop to submit course work. Student will be required to purchase a stethoscope from Year 2.",
    "academic_year": "Quota:  None",
    "course_start": "Full Year",
    "learning_activities": "Total Hours: 1200 ( Lecture Hours 279, Seminar/Tutorial Hours 207, Supervised Practical/Workshop/Studio Hours 44, Programme Level Learning and Teaching Hours 24, Directed Learning and Independent Learning Hours 646 )",
    "assessment": {
      "written_exam_percent": 50,
      "coursework_percent": 35,
      "practical_exam_percent": 15,
      "full_text": "Written Exam\n50 %,\nCoursework\n35 %,\nPractical Exam\n15 %",
      "details": [
        "Written Exam\n50 %,\nCoursework\n35 %,\nPractical Exam\n15 %"
      ]
    },
    "assessment_formatted": "Written Exam: 50%, Coursework: 35%, Practical Exam: 15%",
    "assessment_methods": "Written Exam\n50 %,\nCoursework\n35 %,\nPractical Exam\n15 %",
    "graduate_attributes_and_skills": "All outcome for the MBChB programme are linked to the General Medical Council's Outcome for Graduates:https://www.gmc-uk.org/education/standards-guidance-and-curricula/standards-and-outcomes/outcomes-for-graduates",
    "keywords": "medicine,disease,health,ethics,society",
    "course_organiser": "Dr Sandrine ProstTel:(0131 6)50 2917Email:S.Prost@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MBCH09020",
    "name": "HCP-Med: Foundations of Medicine 2",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch09020.htm",
    "availability": "SS1",
    "period": "Full Year",
    "credits": "90",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 9 (Year 2 Undergraduate)",
    "scqf_credits": "90",
    "summary": "HCP-Med: Foundations of Medicine 2 is the second of two year-long courses, both of which (a) contribute to a comprehensive foundation in biomedical, social and clinical sciences and (b) link that knowledge to clinical practice.  It comprises three biomedical modules, which address aspects of human functioning.  Alongside the biomedical modules, social and ethical aspects of medicine are taught - that teaching emphasises the importance of understanding health and illness from a holistic, biopsychosocial perspective.  Themes from the biomedical and socio-ethical modules are used as examples to teach research skills and professional skills.  During a longitudinal general practice placement, students will be encouraged to link their theoretical learning to their clinical experience and to complete an audit project.",
    "course_description": "1) Academic DescriptionOn completion of HCP-Med: Foundations of Medicine 2, students will have acquired an in depth knowledge of biomedical and social sciences and will be confident in applying that knowledge to clinical medicine.The course comprises three biomedical 'block' modules, each of which covers scientific and clinical dimensions of human functioning: 'Command and Control' which concentrates on endocrinology and neurology; 'Renal/Urology' and 'Nutrition/Digestion'.  A fourth block module, 'Transitions' covers biomedical, psychological and social aspects of major life transitions.  The longitudinal 'parallel' module 'Knowledge to Clinical Practice' (KCP) integrates those topics, and make links with socio-ethical themes, evidence-based medicine and professional skills.The course builds on the learning in HCP-Med: Foundations of Medicine 1.  Taken together, HCP-Med: Foundations of Medicine 1 and 2 prepare the student for HCP-Med: Introduction to Clinical Practice, which is taught in Year 3 of the HCP-Med programme.2) Outline ContentThe course comprises three biomedical 'block' modules as described above.  In addition, five longitudinal modules run throughout the course:(i) 'Social and Ethical Approaches to Medicine' (SEAM), which covers diagnostic labelling and medicalisation, access to care, future health and medicine and ethics;(ii) 'Research and Evidence-Based Medicine' (REBM), which will equip students with knowledge of and skills in statistics and managing data;(iii) 'Knowledge to Clinical Practice' (KCP) is mainly taught in general practice and emphasises the relevance of scientific and clinical knowledge to clinical practice;(iv)'Professional Skills', which includes communication skills, clinical skills and professionalism; and(iv) 'Student Selected Component' (SSC) in which students will complete audit project.3) Student Learning ExperienceHCP-Med: Foundations of Medicine 2 consists of 40 weeks of teaching.  Three weeks are residential and each residential week involves 41 hours of student effort.  The remaining 37 weeks are taught online and in GP placements - each of those weeks demands 21 hours of student effort.Online teaching has two broad aims:(i) To present high quality resources which engage and challenge students and(ii) To create and support a community of learning.Online teaching methods include:- A video introduction, which will include the module's learning outcomes- Pre-recorded narrated lectures covering the main learning points- Discussion boards for both general discussion and specific tasks- Online quizzes- Virtual tutorials using problem-based or case-based learning- Curated online resources",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "academic_year": "Quota:  None",
    "course_start": "Full Year",
    "learning_activities": "Total Hours: 900 ( Programme Level Learning and Teaching Hours 18, Directed Learning and Independent Learning Hours 882 )",
    "assessment": {
      "written_exam_percent": 50,
      "coursework_percent": 40,
      "practical_exam_percent": 10,
      "full_text": "Written Exam\n50 %,\nCoursework\n40 %,\nPractical Exam\n10 %",
      "details": [
        "Written Exam\n50 %,\nCoursework\n40 %,\nPractical Exam\n10 %"
      ]
    },
    "assessment_formatted": "Written Exam: 50%, Coursework: 40%, Practical Exam: 10%",
    "assessment_methods": "Written Exam\n50 %,\nCoursework\n40 %,\nPractical Exam\n10 %",
    "graduate_attributes_and_skills": "As a scholar and scientist: On completion of HCP-Med: Foundations of Medicine 2, the student will be able to demonstrate an understanding of the principles, and evidence base of biomedical science (particularly relating to endocrinology, renal/urology and gastrointestinal system) social sciences and ethics relevant to medicine.  They will be able to apply those principles to clinical scenarios.As a practitioner: On completion of HCP-Med: Foundations of Medicine 2 the student will be able to demonstrate further skills in communicating with patients, applying clinical judgement and using knowledge of biomedical and social science and  ethics.  The student will have acquired further specific practical skills and will be confident in appropriate sharing of academic and clinical information using information technology.As a professional: On completion of HCP-Med: Foundations of Medicine 2, the student will be confident in planning their personal learning and will be competent in contributing to group learning and teamwork.  They will have developed reflective practice in both academic and clinical settings and be able to demonstrate an understanding of the ethical, professional and legal responsibilities of medical students and doctors.  They will continue to attend to personal health, wellbeing and professional development.",
    "keywords": "medicine,medical ethics,human physiology,human anatomy,medical sociology,evidence-based medicine",
    "course_organiser": "Dr Jen KennedyTel:Email:Jen.Kennedy@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH09016",
    "name": "Introduction to Clinical Practice",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch09016.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "20",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 9 (Year 2 Undergraduate)",
    "scqf_credits": "20",
    "summary": "The course is directed towards helping the student acquire the skills, attributes and related knowledge necessary to pactise medicine.",
    "course_description": "Not entered",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "graduate_attributes_and_skills": "Not entered",
    "keywords": "Not entered",
    "course_organiser": "Dr Hilary YoungTel:Email:H.Young@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 0,
      "practical_exam_percent": 0,
      "full_text": "School"
    },
    "assessment_formatted": "",
    "assessment_methods": "School",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH09019",
    "name": "Molecules to Society 2a",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch09019.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "40",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 9 (Year 2 Undergraduate)",
    "scqf_credits": "40",
    "summary": "The course is congruent and contiguous with Year 1, comprising the three principal strands, basic, clinical and social sciences. These are co-ordinated and integrated by problem-based learning scenarios through two modules (neuroscience and GI). Each module will include some biomedical science, behavioural and psychosocial science (which are the two major strands) and clinical science, but to varying proportions. The themes of each module will include problems of a patient with disease of a particular organ system. The interrelationship of biological, psychological and social factors in the causation of disease and on the ability of patients to be cured of or to live with the disease will be demonstrated and serve to emphasise that all learning is relevant to the practice of medicine. The purpose of the courses in Year 2 of the medical course is to act as a bridge between the broad introduction in Year 1 and the more specific, systems-based courses that follow in Year 4.",
    "course_description": "Not entered",
    "pre_requisites": "No Prerequisites",
    "prerequisites": "No Prerequisites",
    "prohibited_combinations": "",
    "graduate_attributes_and_skills": "Not entered",
    "keywords": "Not entered",
    "course_organiser": "Prof John PlevrisTel:Email:J.Plevris@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH09018",
    "name": "Molecules to Society 2b",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch09018.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "40",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 9 (Year 2 Undergraduate)",
    "scqf_credits": "40",
    "summary": "The course is congruent and contiguous with Year 1, comprising the three principal strands, basic, clinical and social sciences. These are co-ordinated and integrated by problem-based learning scenarios through four modules (clinical genetics, renal, endocrinology and science to clinical practice). Each module will include some biomedical science, behavioural and psychosocial science (which are the two major strands) and clinical science, but to varying proportions. The themes of each module will include problems of a patient with disease of a particular organ system. The interrelationship of biological, psychological and social factors in the causation of disease and on the ability of patients to be cured of or to live with the disease will be demonstrated and serve to emphasise that all learning is relevant to the practice of medicine. The purpose of the courses in Year 2 of the medical course is to act as a bridge between the broad introduction in Year 1 and the more specific, systems-based courses that follow in Year 4.",
    "course_description": "Not entered",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "graduate_attributes_and_skills": "Not entered",
    "keywords": "Not entered",
    "course_organiser": "Prof John PlevrisTel:Email:J.Plevris@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MBCH09006",
    "name": "Student Selected Component 2a and 2b",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch09006.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "20",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 9 (Year 2 Undergraduate)",
    "scqf_credits": "20",
    "summary": "Students express preferences for topics from a selection spanning medical, scientific and non-medical subjects.  Most are studies in depth in small groups in a self-directed manner guided by a tutor.  The course is diverse in area, content, and approach to study.  It will prove to be quite different from the type of task that students have been asked to tackle before in the curriculum, although elements of it will be familiar.  The breadth, depth, and lack of prescribed direction of investigation have proved particularly unfamiliar to many undertaking the small group projects.  The use of the web in these groups is particularly unusual.  Its use for course information such as timetabling and handouts is now commonplace, but in this course websites are also the end product of the project for most students.",
    "course_description": "Not entered",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "graduate_attributes_and_skills": "Not entered",
    "additional_class_delivery_information": "Two blocks, each lasting four weeks, span Christmas and Easter vacations.",
    "keywords": "Not entered",
    "course_organiser": "Miss Jamie McQueenTel:Email:jmcquee4@exseed.ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH09021",
    "name": "Whole Body Health 2",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch09021.htm",
    "availability": "SS1",
    "period": "Full Year",
    "credits": "120",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 9 (Year 2 Undergraduate)",
    "scqf_credits": "120",
    "summary": "Year 2 of the medicine programme will build on your understanding of health, disease and wellbeing and how these are affected by society and the wider environment. The course will give an understanding of research methods and interpretation of scientific information. This knowledge will be integrated with common diseases and will build on core professional values and ethical principles introduced in Year 1.",
    "course_description": "The course will cover Command and Control, Transitions, Renal and Urology and Nutrition and Digestion. This knowledge will be integrated with clinical practice.Socio-ethical Aspects of Medicine (SEAM) will cover social determinants of illness, meaning of illness, experience of illness, medical ethics, public health and health improvement.Research and Evidence Based Medicine (REBM) will cover understanding information, the role of evidence-based medicine, hypothesis driven and hypothesis free research, types of data, evaluating interventions, critical appraisal and communication of research.Knowledge to Clinical Practice (KCP) is directed towards helping students acquire the skills, attributes and related knowledge necessary to practise medicine.Professional Skills will cover importance of communication, empathy, compassion and wellbeing.The course will be delivered through lectures, seminars, tutorials, online resources and in person sessions. Clinical and communication skills sessions and Problem Based Learning will also be used to explore more deeply both knowledge and approach to learning.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "additional_costs": "Travel to community placements will be required. The Medical School provides a small subsidy to help with these costs but they do not cover the full expenditure. Students will also need access to a smart device or laptop to submit course work. Student will be required to purchase a stethoscope from Year 2.",
    "academic_year": "Quota:  None",
    "course_start": "Full Year",
    "learning_activities": "Total Hours: 1200 ( Lecture Hours 90, Seminar/Tutorial Hours 207, Supervised Practical/Workshop/Studio Hours 40, External Visit Hours 30, Online Activities 60, Feedback/Feedforward Hours 2, Formative Assessment Hours 5, Summative Assessment Hours 10, Revision Session Hours 35, Programme Level Learning and Teaching Hours 24, Directed Learning and Independent Learning Hours 697 )",
    "assessment": {
      "written_exam_percent": 50,
      "coursework_percent": 35,
      "practical_exam_percent": 15,
      "full_text": "Written Exam\n50 %,\nCoursework\n35 %,\nPractical Exam\n15 %",
      "details": [
        "Written Exam\n50 %,\nCoursework\n35 %,\nPractical Exam\n15 %"
      ]
    },
    "assessment_formatted": "Written Exam: 50%, Coursework: 35%, Practical Exam: 15%",
    "assessment_methods": "Written Exam\n50 %,\nCoursework\n35 %,\nPractical Exam\n15 %",
    "graduate_attributes_and_skills": "All outcome for the MBChB programme are linked to the General Medical Council's Outcome for Graduates:https://www.gmc-uk.org/education/standards-guidance-and-curricula/standards-and-outcomes/outcomes-for-graduates",
    "keywords": "Not entered",
    "course_organiser": "Prof John PlevrisTel:Email:J.Plevris@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH10024",
    "name": "HCP-Med: Process of Care 1",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch10024.htm",
    "availability": "SS1",
    "period": "Full Year",
    "credits": "90",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 10 (Year 3 Undergraduate)",
    "scqf_credits": "90",
    "summary": "HCP-Med: Process of Care 1: follows on from HCP-Med: Foundations of Medicine 1 and 2.  It equips students with a solid foundation in the generalities of medical practice.  Most of the knowledge-based curriculum will be presented online.  Clinical experience will be gained through placements in a variety of secondary care settings as well as three sessions per week in general practice.The course covers the fundamentals of how patients present, how the clinical team works, communication and consultation skills, and how clinical management is determined and implemented by healthcare teams, in partnership with the patient and their carers.In hospital and primary care settings, students will put into practice the foundational knowledge and skills developed in HCP-Med: Foundations of Medicine 1 and 2.  They will assess patients by taking clinical histories and clinical examination, they will propose and interpret investigations and formulate clinical management plans. The course emphasises  a holistic, patient-centred approach, which recognises and addresses the physical, social and psychological dimensions of illness and wellbeing.",
    "course_description": "HCP-Med: Process of Care 1 consists of 40 weeks of teaching and comprises three residential weeks, each of which include 41 hours of student effort.  The remaining 37 weeks of include online teaching and time in clinical placements.  The online/clinical weeks each involve 21 hours of student effort.Teaching and learning includes the following approaches:Online teaching has two broad aims:(i) To present high quality resources which engage and challenge students and(ii) To create and support a community of learning.A range of teaching methods will be used:- Each module will start with a video introduction, including the learning outcomes- Pre-recorded narrated lectures, with slides which will cover the main learning points- Discussion boards will be used for both general discussion and specific tasks- Students will monitor their learning through frequent online quizzes- Virtual tutorials will use problem-based or case-based learning- Students will be provided with links to curated online resourcesResidential weeks will include lectures, tutorials, group-work, workshops for communication skills and clinical skills, and practical demonstrations for anatomy.General practices placements will use a variety of teaching methods:(i) apprentice-style observation of surgeries, which will provide early exposure to a wide range of clinical cases and allow ad-hoc discussion of cases relevant to the online curriculum;(ii) tutorials covering aspects of professional knowledge, skills and behaviours to complement online teaching; and(iii) shadowing members of the primary care team to reinforce online teaching.Other clinical placements will include teaching in outpatient clinics, wards, operating theatres, and sessions to learn about imaging and the work of investigative laboratories.Throughout the course, students will be encouraged to develop self-directed learning,  This will pose a challenge for the students and they will be supported in this approach.  Clear guidance will be given so that students can prioritise their reading.  Self-directed learning will be supplemented by interactive tutorials, online and often in clinical settings.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "academic_year": "Quota:  None",
    "course_start": "Full Year",
    "learning_activities": "Total Hours: 900 ( Programme Level Learning and Teaching Hours 18, Directed Learning and Independent Learning Hours 882 )",
    "assessment": {
      "written_exam_percent": 70,
      "coursework_percent": 0,
      "practical_exam_percent": 30,
      "full_text": "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %",
      "details": [
        "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %"
      ]
    },
    "assessment_formatted": "Written Exam: 70%, Practical Exam: 30%",
    "assessment_methods": "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %",
    "graduate_attributes_and_skills": "Throughout the MBChB programme, the curriculum offers challenging opportunities and support to ensure all successful students develop the University graduate attributes of Enquiry and Lifelong Learning, Aspiration and Personal Development, and Outlook and Engagement.More specifically the list below describes how the Process of Care 1 Course Learning Outcomes map to the 4 sets of Graduate Attributes and Skills, Knowledge and Understanding and Technical/Practical Skills.Knowledge and Understanding:The successful student completing this Course will apply to clinical practice, research and teaching their extensive knowledge and understanding described within the following themes:Biomedical Sciences:Psychological Aspects of MedicineSocial Sciences and Public HealthPresentation, Diagnosis and ManagementClinical Pharmacology and TherapeuticsMedical Ethics, Legal and Professional ResponsibilitiesGraduate attributes:Skills and abilities in Research and Enquiry -The successful student completing this Course will apply to clinical practice, research and teaching, the skills and attributes described within the following themes:Evidence-Based Medicine and ResearchMedical InformaticsPersonal Professional DevelopmentGraduate attributes: Skills and abilities in Personal and Intellectual Autonomy -The successful student completing this Course will demonstrate socially-responsible independent thinking and take responsibility for their own actions through the application of skills and attributes described within the following themes:Medical Ethics, Legal And Professional ResponsibilitiesPersonal Professional DevelopmentGraduate attributes:Skills and abilities in Communication -The successful student completing this Course will use a range of communication skills in common clinical settings described within the following themes:The ConsultationClinical CommunicationMedical InformaticsGraduate attributes:Skills and abilities in Personal Effectiveness -The successful student completing this Course will be reflective and self-regulating, preparing for high levels of professional achievement and able to work well with others as described within the following theme:Personal Professional Development (PPD)Technical / Practical skills:The successful student completing this Course will have the skills and technical abilities to permit them to function as a Foundation Doctor and postgraduate learner as described within the following themes:The Consultation:Emergency Care, Clinical and Resuscitation SkillsClinical PharmacologyTherapeuticsMedical Informatics",
    "keywords": "medicine,medical-ethics,Human Physiology,Human anatomy,Medical Sociology,Evidence-based medicine",
    "course_organiser": "Dr Jen KennedyTel:Email:Jen.Kennedy@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH10022",
    "name": "Preparation for Practice (Alberta route)",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch10022.htm",
    "availability": "SS1",
    "period": "Full Year",
    "credits": "180",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 10 (Year 6 Undergraduate)",
    "scqf_credits": "180",
    "summary": "During Year 6 - Preparation for Practice students will become accustomed to assisting a doctor in a clinic or surgery, a ward, or operating theatre, and will become a valued member of the health-care team. By the end of the year students will be prepared to start Canadian Residency Programme.The year is organised into four blocks each of 4 weeks followed by Finals exams and then a further 12 weeks for the Assistantship and Elective. There are vacations in semester 1 and 2.Over the summer between Year 5 and Year 6, students are completing the Alberta attachment which includes the General Practice (Family Medicine) and General Medicine (General Internal Medicine) components of the Year 6 course. There is opportunity for Canadian or North American elective attachments during this time period. Students will undertake Emergency Medicine, Acute Medicine, Surgery, Anaesthetics and Critical Care on return to Edinburgh. Students may need to return to Canada for residency interviews.  Following final Exams, students undertake the Assistantship. Elective is undertake in summer prior to returning to Edinburgh for Year 6.The attachments during Preparation for Practice are broad-based in medicine, surgery and primary care, and students will consolidate and expand their abilities to manage patients presenting with symptoms in any system, including emergencies.There are opportunities for formative feedback throughout the Course.The Final Exams comprise written, practical and oral assessments during January/February. In addition students are required to take formative progress tests and complete the Alberta attachment satisfactorily. Students are expected to demonstrate a professional approach to their studies and conduct.",
    "course_description": "The Modules include Medicine (General Internal Medicine), General Practice (Family Medicine), Surgery, Anaesthetics, Critical Care, Emergency Medicine and Acute Medicine and Assistantship.The teaching and learning experiences are varied and include: interactive lectures, large group interactive plenaries, small group tutorials, directed reading using a range of materials including online lectures and computer based learning packages, resuscitation, clinical skills and communication workshops, clinical teaching in GP surgeries, clinics, wards, operating theatres, imaging and investigative labs.Throughout Year 6 students are expected and encouraged to adopt an apprenticeship role under supervision, as much as possible. There are many opportunities to get involved in the care of patients though students must be proactive to make the most of them. There is support and guidance in the form of learning outcomes and core content as usual. In addition the learning activities for each module, such as clerking patients and completing portfolio activities indicate what is required to ensure students are competent at FY1 level by the time of graduation. There are few lectures and tutorials in Year 6, other than 'bedside' teaching, but there will be guided reading and many online resources. The portfolio case summaries continue to encourage students to explore patients' needs in depth and to synthesise and summarise these needs and clinical management succinctly to colleagues. At the end of modules tutors review evidence of performance with students and provide additional written and verbal narrative comments on general progress, with suggestions for developments.During the Assistantship, students are expected to undertake the tasks of the FY1 doctor under close supervision, to help them transfer their learning to everyday clinical practice and to gain confidence before starting work as FY1 doctors. The SSC 6 (Elective) gives students an opportunity to travel and explore clinical practice in another part of the country or the world. Students are reminded not to take on tasks beyond their competence, but the exact experiences and practical work will vary depending where they choose to go.During the Alberta attachment students are expected to undertake the tasks of the doctor under close supervision, to help them transfer their learning to everyday clinical practice and to gain confidence before starting work as doctors.There are many other opportunities for feedback, described below. Students are expected to reflect on this feedback, discuss it with their Undergraduate Supervisors (or the Year Director) and use it to further direct and regulate their own learning.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "additional_costs": "Students will pay their own MCCQE exam fees and any preparatory material for this exam.Students will pay for flights to and from Canada.",
    "academic_year": "Quota:  None",
    "course_start": "Full Year",
    "learning_activities": "Total Hours: 1800 ( Other Study Hours 579, Programme Level Learning and Teaching Hours 36, Placement Study Abroad Hours 750, Directed Learning and Independent Learning Hours 435 )",
    "assessment": {
      "written_exam_percent": 50,
      "coursework_percent": 0,
      "practical_exam_percent": 50,
      "full_text": "Written Exam\n50 %,\nCoursework\n0 %,\nPractical Exam\n50 %",
      "details": [
        "Written Exam\n50 %,\nCoursework\n0 %,\nPractical Exam\n50 %"
      ]
    },
    "assessment_formatted": "Written Exam: 50%, Practical Exam: 50%",
    "assessment_methods": "Written Exam\n50 %,\nCoursework\n0 %,\nPractical Exam\n50 %",
    "graduate_attributes_and_skills": "MBChB graduates will gain the University of Edinburgh's Graduate Attributes (https://www.ed.ac.uk/employability/graduate-attributes) and will meet all of the General Medical Council's  outcomes for graduates (https://www.gmc-uk.org/education/standards-guidance-and-curricula/standards-and-outcomes/outcomes-for-graduates).",
    "special_arrangements": "Students are required to complete an Alberta attachment commencing in first 10 weeks of this course, having already spent 6 weeks in Alberta.  Edinburgh will provide a travel and subsistence subsidy to students for the period of time spent in Alberta.",
    "keywords": "Internal&family medicine,medicine of elderly,surgery,emergency medicine,anaesthetics,critical care",
    "course_organiser": "Dr Alix RolfeTel:(0131 6)51 4362Email:Alix.Rolfe@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH10023",
    "name": "Process of Care 2 (Alberta route)",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch10023.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "180",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 10 (Year 5 Undergraduate)",
    "scqf_credits": "180",
    "summary": "In Year 5 - Process of Care 2 students move on from the generalities of clinical practice to encounter a wide variety of key medical specialties. By the end of the Course students should be able to assist a doctor in providing clinical care.The year is organised into three semesters with each divided into two 5 week blocks with Objective Structured Clinical Examination (OSCE) assessments at the end of each followed by vacation.Students build on the knowledge and skills of earlier Courses and increasingly engage in everyday clinical practice within the limits of their competence and under careful supervision. Teaching and learning methods remain varied as in Year 4 with the addition of further modes.For SSC5 Teaching, students work in small groups to contribute to peer assisted learning. This might be teaching on an established project such as the practice OSCE for students in earlier years or developing something new.There are opportunities for formative feedback throughout the Course.Assessments occur at the end of each semester in the form of a clinical exam (usually an OSCE) and at the end of the in the form of written exams (MCQ and very short answer questions) and OSCE. Students are expected to demonstrate a professional approach to their studies and conduct.At the end of the academic year, students go to Canada for the Alberta attachment, which offers clinical clerkship experience over the summer between Years 5 and 6.",
    "course_description": "The modules include Psychiatry, Child Life & Health, Obstetrics and Gynaecology, Haematology, Oncology, Palliative Care, Breast Diseases, Urology, Renal, Orthopaedics, Dermatology, Ophthalmology, Otolaryngology (ENT), Student Selected Component 5 Teaching and portfolio components on Doctor as a Safe Practitioner, Communicator, and Educator.The teaching and learning experiences are varied and include interactive lectures, small group tutorials, directed reading using a range of materials including online lectures and computer based learning packages, resuscitation, clinical skills and communication workshops. Students can be based in community, clinics, wards, operating theatres, imaging, and investigative labs. The SSC5 Teaching is a group project aimed at developing the learning of others.The curriculum and its teaching and learning methods continue to guide the development of self-directed learning. Less of the required knowledge is provided in face to face or online lectures but there will be clear guidance to prioritise students' reading and these methods are complemented by interactive tutorials, often in the clinical setting. The portfolio case summaries direct students to explore in depth the needs of individual patients, and to reflect on and critique current approaches to management. The clinical skills observations offer students another opportunity to take responsibility for their own learning and emulates the requirements of postgraduate medical training for new doctors. Students are expected to challenge themselves to be observed in new tasks, capture the feedback and store it in their portfolio to help them recall it and use it to improve their performance. At the end of modules tutors review the evidence of performance (e.g. clinical observations) with students and provide additional written and verbal comments on general progress, with suggestions for developments.There are many other opportunities for feedback, described below. Students are expected to reflect on this feedback, discuss it with their Undergraduate Supervisor (or Year Director) and use it to further direct and regulate their own learning.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "additional_costs": "Students will pay their own MCCQE exam fees and any preparatory material for this exam.Students will pay for flights to and from Canada.",
    "graduate_attributes_and_skills": "MBChB graduates will gain the University of Edinburgh's Graduate Attributes (https://www.ed.ac.uk/employability/graduate-attributes) and will meet all of the General Medical Council's outcomes for graduates (https://www.gmc-uk.org/education/standards-guidance-and-curricula/standards-and-outcomes/outcomes-for-graduates).",
    "special_arrangements": "Students are required to complete an Alberta attachment commencing at the end of this course.Edinburgh will provide a travel and subsistence subsidy to students for the period of time spent in Alberta.",
    "keywords": "Alberta,Dermatology,Haematology,Obstetrics,Gynaecology,Oncology,Ophthalmology,Renal,ENT,Paediatrics",
    "course_organiser": "Prof Colin DuncanTel:Email:W.C.Duncan@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 0,
      "practical_exam_percent": 0,
      "full_text": "School"
    },
    "assessment_formatted": "",
    "assessment_methods": "School",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MBCH10025",
    "name": "Year 4 - Process of Care (Exit)",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch10025.htm",
    "availability": "SS2",
    "period": "Semester 1",
    "credits": "120",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 10 (Year 4 Undergraduate)",
    "scqf_credits": "120",
    "summary": "*This course is for students who wish to leave the MBChB programme with a BMedSci award* Students are not permitted to progress into Year 5 of the MBChB programme once completing this course.The emphasis throughout Year 4 - Process of Care 1 is on achieving a solid foundation in the generalities of medical practice.Students rotate through large mainly systems-based specialties but the emphasis throughout is on learning the fundamentals of how patients present, how the clinical team works and how clinical management is determined and implemented by teams in partnership with the patient and carers.In a wide range of hospital and General Practice settings students will put into practice the foundational knowledge and skills developed in Years 1 and 2 of the MBChB. They will assess patients in the specialties of the Course, through history-taking and clinical examination, will propose and interpret investigations and learn to create clinical management plans. Throughout, there will be an emphasis on communication and consultation skills within a holistic and patient-centred approach that recognises and addresses the physical, social and psychological perspectives of wellbeing and ill health.Hospital and systems-based attachments will be complemented by an attachment in primary care and by another focusing on inter-professional teamwork, the life of a ward and patient safety.Assessments occurs in the form of written exams (MCQ and short answer questions), anatomy practicals, case reports and a clinical exam (Objective Structured Clinical Examination) at the end of the year.  Students are tested formatively throughout the year with progress tests and are expected to demonstrate a professional approach towards their studies and conduct.",
    "course_description": "Modules include Cardiovascular, Respiratory, GP with Psychiatry, Neurosciences, Diabetes & Endocrinology, Rheumatology, Orthopaedics & Surgical Principles, GI and Liver, Infection, Team.The teaching and learning experiences are varied and include: lectures, large group interactive plenaries, small group tutorials, directed reading using a range of materials including online lectures and computer based learning packages, anatomy practicals, resuscitation, clinical skills and communication workshops, clinical teaching in GP surgeries, clinics, wards, operating theatres, imaging and investigative labs.There is a 2-week attachment when students become embedded in the ward team to learn more about the life of a ward, patient safety and working in a multi-professional team.The curriculum and its teaching and learning methods continue to guide the development of self-directed learning. This requires both challenge and support. Less of the required knowledge is provided in face to face or online lectures but there will be clear guidance to prioritise students' reading and these methods are complemented by interactive tutorials, often in the clinical setting. The portfolio case reports direct students to explore in depth the needs of individual patients, and to reflect on and critique current approaches to clinical management. Clinical Observations offer students another opportunity to take responsibility for their own learning and emulates the requirements of postgraduate medical training for new doctors. Students can challenge themselves to be observed in new tasks, capture the feedback and store it in their portfolio to help them recall it and use it to improve their performance. At the end of modules tutors review the evidence of performance with students and provide additional written and verbal narrative comments on general progress, with suggestions for developments.There are many other opportunities for feedback. Students are expected to reflect on this feedback, discuss it with their Personal Tutors and use it to further direct and regulate their own learning.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "academic_year": "Quota:  None",
    "course_start": "Semester 1",
    "learning_activities": "Total Hours: 1200 ( Programme Level Learning and Teaching Hours 24, Directed Learning and Independent Learning Hours 1176 )",
    "assessment": {
      "written_exam_percent": 70,
      "coursework_percent": 0,
      "practical_exam_percent": 30,
      "full_text": "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %",
      "details": [
        "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %"
      ]
    },
    "assessment_formatted": "Written Exam: 70%, Practical Exam: 30%",
    "assessment_methods": "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %",
    "graduate_attributes_and_skills": "Throughout the MBChB programme, the curriculum offers challenging opportunities and support to ensure all successful students develop the University graduate attributes of Enquiry and Lifelong Learning, Aspiration and Personal Development, and Outlook and Engagement.More specifically the list below describes how the Process of Care 1 Course Learning Outcomes map to the 4 sets of Graduate Attributes and Skills, Knowledge and Understanding and Technical/Practical Skills.Knowledge and Understanding.The successful student completing this Course will apply to clinical practice, research and teaching their extensive knowledge and understanding described within the following themes:Biomedical SciencesPsychological Aspects of MedicineSocial Sciences and Public HealthPresentation, Diagnosis and ManagementClinical Pharmacology and TherapeuticsMedical Ethics, Legal and Professional ResponsibilitiesGraduate attributes: Skills and abilities in Research and Enquiry.The successful student completing this Course will apply to clinical practice, research and teaching, the skills and attributes described within the following themes:Evidence-Based Medicine and ResearchMedical InformaticsPersonal Professional DevelopmentGraduate attributes: Skills and abilities in Personal and Intellectual Autonomy.The successful student completing this Course will demonstrate socially-responsible independent thinking and take responsibility for their own actions through the application of skills and attributes described within the following themes:Medical Ethics, Legal And Professional ResponsibilitiesPersonal Professional DevelopmentGraduate attributes: Skills and abilities in Communication.The successful student completing this Course will use a range of communication skills in common clinical settings described within the following themes:The ConsultationClinical CommunicationMedical InformaticsGraduate attributes: Skills and abilities in Personal Effectiveness.The successful student completing this Course will be reflective and self-regulating, preparing for high levels of professional achievement and able to work well with others as described within the following theme:Personal Professional Development (PPD)Technical / practical skills.The successful student completing this Course will have the skills and technical abilities to permit them to function as a Foundation Doctor and postgraduate learner as described within the following themes:The ConsultationEmergency Care, Clinical and Resuscitation SkillsClinical PharmacologyTherapeuticsMedical Informatics",
    "keywords": "MBChB,BMedSci,Exit",
    "course_organiser": "Dr Eleri WilliamsTel:Email:Eleri.Williams@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH10020",
    "name": "Year 4 - Process of Care 1",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch10020.htm",
    "availability": "SS1",
    "period": "Full Year",
    "credits": "180",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 10 (Year 4 Undergraduate)",
    "scqf_credits": "180",
    "summary": "The emphasis throughout Year 4 - Process of Care 1 is on achieving a solid foundation in the generalities of medical practice,The year is organised into three 10 week semesters with a week vacation at the end.Students rotate through these semesters which are based on 10 weeks in General Practice and 20 weeks in Hospital settings.  The emphasis throughout  is on learning the fundamentals of how patients present, how the clinical team works and how clinical management is determined and implemented by teams in partnership with the patient and carers.In the Hospital and General Practice settings, students will put into practice the foundational knowledge and skills developed in Years 1 and 2 of the MBChB programme. They will assess patients in the specialties through history-taking and clinical examination, will propose and interpret investigations and learn to create clinical management plans. Throughout, there will be an emphasis on communication and consultation skills within a holistic and patient-centred approach that recognises and addresses the physical, social and psychological perspectives of wellbeing and ill health.Hospital-based placements will be complemented by an attachment in a primary care setting. Students will also focus on inter-professional teamwork, the life of a ward and patient safety.There are opportunities for formative feedback throughout the Course.Assessments occur throughout the year with students required to complete a Clinical ePortfolio, and at the end of the year in the form of written exams (MCQ and very short answer questions) and clinical exams (Objective Structured Clinical Examination).",
    "course_description": "Specialty areas include Cardiovascular, Respiratory, GP with Psychiatry, Neurosciences, Diabetes & Endocrinology, Rheumatology, GI and Liver, and Infection, with introductions to Orthopaedics & Surgical Principles, Haematology, Renal and Dermatology.The teaching and learning experiences are varied and will include interactive lectures, small group tutorials, directed reading using a range of materials including online lectures and computer based learning packages, resuscitation, clinical skills and communication workshops, clinical teaching in GP surgeries, clinics, wards, operating theatres, imaging and investigative labs.The curriculum and its teaching and learning methods continue to guide the development of self-directed learning. . Less of the required knowledge is provided in face to face or online lectures but there will be clear guidance to prioritise students' reading and these methods are complemented by interactive tutorials, often in the clinical setting. Completion of the Clinical ePortfolio allows students to explore in depth the needs of individual patients, and to reflect on and critique current approaches to clinical management. Students are expected to challenge themselves to undertake observations, capture  feedback and store it in their portfolio to help them recall it and use it to improve their performance. At the end of placements, tutors review the evidence of performance (e.g. clinical observations) with students and provide additional written and verbal comments on l progress, with suggestions for developments.There are many other opportunities for feedback. Students are expected to reflect on this feedback, discuss it with their Undergraduate Supervisors and use it to further direct and regulate their own learning.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "additional_costs": "Travel to Lothian and/or regional placements will be required. The Medical School provides a subsidy to help with these costs but they may not cover the full expenditure. Accommodation will be provided at most regional placements.Students will also need access to a smart device or laptop to submit course work.Students will be required to have their own stethoscope.",
    "academic_year": "Quota:  None",
    "course_start": "Full Year",
    "learning_activities": "Total Hours: 1800 ( Lecture Hours 85, Seminar/Tutorial Hours 65.5, Supervised Practical/Workshop/Studio Hours 28, Online Activities 28, Feedback/Feedforward Hours 7, Summative Assessment Hours 10, Programme Level Learning and Teaching Hours 36, Placement Study Abroad Hours 746, Directed Learning and Independent Learning Hours 794 )",
    "assessment": {
      "written_exam_percent": 70,
      "coursework_percent": 0,
      "practical_exam_percent": 30,
      "full_text": "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %",
      "details": [
        "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %"
      ]
    },
    "assessment_formatted": "Written Exam: 70%, Practical Exam: 30%",
    "assessment_methods": "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %",
    "graduate_attributes_and_skills": "GRADUATE ATTRIBUTES, PERSONAL AND PROFESSIONAL SKILLSThroughout the MBChB programme, the curriculum offers challenging opportunities and support to ensure all successful students develop the University graduate attributes of Enquiry and Lifelong Learning, Aspiration and Personal Development, and Outlook and Engagement.More specifically the list below describes how the Process of Care 1 Course Learning Outcomes map to the 4 sets of Graduate Attributes and Skills, Knowledge and Understanding and Technical/Practical Skills.Knowledge and Understanding.The successful student completing this Course will apply to clinical practice, research and teaching their extensive knowledge and understanding described within the following themes:Biomedical SciencesPsychological Aspects of MedicineSocial Sciences and Public HealthPresentation, Diagnosis and ManagementClinical Pharmacology and TherapeuticsMedical Ethics, Legal and Professional ResponsibilitiesGraduate attributes: Skills and abilities in Research and Enquiry.The successful student completing this Course will apply to clinical practice, research and teaching, the skills and attributes described within the following themes:Evidence-Based Medicine and ResearchMedical InformaticsPersonal Professional DevelopmentGraduate attributes: Skills and abilities in Personal and Intellectual Autonomy.The successful student completing this Course will demonstrate socially-responsible independent thinking and take responsibility for their own actions through the application of skills and attributes described within the following themes:Medical Ethics, Legal And Professional ResponsibilitiesPersonal Professional DevelopmentGraduate attributes: Skills and abilities in Communication.The successful student completing this Course will use a range of communication skills in common clinical settings described within the following themes:The ConsultationClinical CommunicationMedical InformaticsGraduate attributes: Skills and abilities in Personal Effectiveness.The successful student completing this Course will be reflective and self-regulating, preparing for high levels of professional achievement and able to work well with others as described within the following theme:Personal Professional Development (PPD)Technical / practical skills.The successful student completing this Course will have the skills and technical abilities to permit them to function as a Foundation Doctor and postgraduate learner as described within the following themes:The ConsultationEmergency Care, Clinical and Resuscitation SkillsClinical PharmacologyTherapeuticsMedical Informatics",
    "keywords": "Cardio,Resp,GP,Psychiatry,Neuro,Othopaedics,Surgery,Rheumatology,GI&Liver,Team,Infection,Endocrin",
    "course_organiser": "Dr Eleri WilliamsTel:Email:Eleri.Williams@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH10021",
    "name": "Year 5 - Process of Care 2",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch10021.htm",
    "availability": "SS1",
    "period": "Full Year",
    "credits": "180",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 10 (Year 5 Undergraduate)",
    "scqf_credits": "180",
    "summary": "In Year 5 - Process of Care 2 students move on from the generalities of clinical practice to encounter a wide variety of key medical specialties. By the end of the Course students should be able to assist a doctor in providing clinical care.The year is organised into three semesters with each divided into two 5 week blocks with Objective Structured Clinical Examination (OSCE) assessments at the end of each followed by vacation.Students build on the knowledge and skills of earlier Courses and increasingly engage in everyday clinical practice within the limits of their competence and under careful supervision. Teaching and learning methods remain varied as in Year 4 with the addition of further modes.For SSC5 Teaching, students work in small groups to contribute to peer assisted learning. This might be teaching on an established project such as the practice OSCE for students in earlier years or developing something new.There are opportunities for formative feedback throughout the Course.Assessments occur at the end of each semester in the form of a clinical exam, usually an OSCE, and at the end of the in the form of written exams (MCQ and very short answer questions) and OSCE. Students are expected to demonstrate a professional approach to their studies and conduct.",
    "course_description": "The modules include Psychiatry, Child Life & Health, Obstetrics and Gynaecology, Haematology, Oncology, Palliative Care, Breast Diseases, Urology, Renal, Orthopaedics, Dermatology, Ophthalmology, Otolaryngology (ENT), Student Selected Component 5 Teaching and portfolio components on Doctor as a Safe Practitioner, Communicator, and Educator.The teaching and learning experiences are varied and include interactive lectures, small group tutorials, directed reading using a range of materials including online lectures and computer based learning packages, resuscitation, clinical skills and communication workshops. Students can be based in community, clinics, wards, operating theatres, imaging, and investigative labs. SSC5 Teaching is a group project aimed at developing the learning of others.The curriculum and its teaching and learning methods continue to guide the development of self-directed learning. Less of the required knowledge is provided in face to face or online lectures but there will be clear guidance to prioritise students' reading and these methods are complemented by interactive tutorials, often in the clinical setting. The portfolio case reports summaries direct students to explore in-depth the needs of individual patients, and to reflect on and critique current approaches to management. The clinical skills observations offer students another opportunity to take responsibility for their own learning, and emulates the requirements of postgraduate medical training for new doctors. Students are expected to challenge themselves to be observed in new tasks, capture the feedback and store it in their portfolio to help them recall it and use it to improve their performance. At the end of modules, tutors review the evidence of performance (e.g. clinical observations) with students and provide additional written and verbal comments on general progress, with suggestions for developments.There are many other opportunities for feedback, described below. Students are expected to reflect on this feedback, discuss it with their Undergraduate Supervisor (or Year Director) and use it to further direct and regulate their own learning.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "additional_costs": "Travel to Lothian and/or regional placements will be required. The Medical School provides a subsidy to help with these costs but they may not cover the full expenditure. Accommodation will be provided at most regional placements.Students will also need access to a smart device or laptop to submit course work.Students will be required to have their own stethoscope.",
    "academic_year": "Quota:  None",
    "course_start": "Full Year",
    "learning_activities": "Total Hours: 1800 ( Lecture Hours 61, Seminar/Tutorial Hours 123, Dissertation/Project Supervision Hours 250, Supervised Practical/Workshop/Studio Hours 7.5, Online Activities 63, Feedback/Feedforward Hours 7.5, Formative Assessment Hours 6, Revision Session Hours 11, Other Study Hours 86, Programme Level Learning and Teaching Hours 36, Placement Study Abroad Hours 750, Directed Learning and Independent Learning Hours 399 )",
    "assessment": {
      "written_exam_percent": 70,
      "coursework_percent": 0,
      "practical_exam_percent": 30,
      "full_text": "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %",
      "details": [
        "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %"
      ]
    },
    "assessment_formatted": "Written Exam: 70%, Practical Exam: 30%",
    "assessment_methods": "Written Exam\n70 %,\nCoursework\n0 %,\nPractical Exam\n30 %",
    "graduate_attributes_and_skills": "GRADUATE ATTRIBUTES, PERSONAL AND PROFESSIONAL SKILLSThroughout the MBChB programme, the curriculum offers challenging opportunities and support to ensure all successful students develop the University graduate attributes of Enquiry and Lifelong Learning, Aspiration and Personal Development, and Outlook and Engagement.More specifically the list below describes how the Course Learning Outcomes address, with some overlap, the 4 sets of skills and abilities that underpin the graduate attributes.  The Course study guides provide further information in the detailed learning outcomes for each module.The successful student completing this Course will be able to demonstrate the following skills and abilities in RESEARCH and ENQUIRY, contributing to the University Graduate Attributes:Biomedical Sciences (BMS)apply to a broad range of defined specialties, the biomedical scientific principles, method and knowledge relating to relevant sciences including anatomy, biochemistry, cell biology, genetics, immunology, microbiology, molecular biology, nutrition, pathology and physiology.Psychological Aspects of Medicine  (PAM)recognise and assess important psychological and behavioural aspects of health, illness and disease; and respond appropriately to these aspects, using strategies such as explanation and advice to address them.Social Sciences and Public Health (SSPH)implement, at a clinical level, knowledge of how to understand the experience of illness and illness behaviour for a broad range of defined specialties; and describe how to prevent disease, prolong life and promote health through the organised efforts of society, analyse a population's health problems, establish the causes and effects of these problems and assist appropriately in implementing effective solutions.Evidence-Based Medicine and Research (EBM&R)use the best available medical evidence, found through a systematic search and appraisal of the relevant information sources, to inform their clinical thinking for a broad range of defined specialties; and develop new knowledge or personal understanding through the application of basic research methods and skills.Presentation, Diagnosis and Management (PDM)describe the modes of presentation and natural history of diseases, recognise and interpret the signs and symptoms with which people present to doctors, construct a differential diagnosis, and suggest appropriate methods to investigate, treat and care for patients in a multi-professional setting for a broad range of defined specialties and contexts.Emergency Care, Clinical And Resuscitation Skills (ECCARS)recognise and systematically assess acutely unwell patients, and institute immediate management, including first aid and resuscitation in a simulated setting, and perform a broad range of clinical skills and procedures safely and effectively in defined contexts.Clinical Pharmacology And Therapeutics  (CPT)describe how drugs act and apply this knowledge to clinical practice to match appropriate drugs to the clinical context, to review the appropriateness of medication and to evaluate the potential benefits and risks for a broad range of defined specialities and contexts; and to prescribe clearly and accurately in simulated situations.Personal Professional Development (PPD)take a reflective and self-directed approach to the ongoing study of medicine in a broad range of defined specialties and contexts, work effectively in a team, and develop others' learning in order to enhance safe patient care, maximise effectiveness and enjoyment.GRADUATE ATTRIBUTES, PERSONAL AND PROFESSIONAL SKILLSThroughout the MBChB programme, the curriculum offers challenging opportunities and support to ensure all successful students develop the University graduate attributes of Enquiry and Lifelong Learning, Aspiration and Personal Development, and Outlook and Engagement.More specifically the list below describes how the Process of Care 1 Course Learning Outcomes map to the 4 sets of Graduate Attributes and Skills, Knowledge and Understanding and Technical/Practical Skills.Knowledge and Understanding.The successful student completing this Course will apply to clinical practice, research and teaching their extensive knowledge and understanding described within the following themes:Biomedical SciencesPsychological Aspects of MedicineSocial Sciences and Public HealthPresentation, Diagnosis and ManagementClinical Pharmacology and TherapeuticsMedical Ethics, Legal and Professional ResponsibilitiesGraduate attributes: Skills and abilities in Research and Enquiry.The successful student completing this Course will apply to clinical practice, research and teaching, the skills and attributes described within the following themes:Evidence-Based Medicine and ResearchMedical InformaticsPersonal Professional DevelopmentGraduate attributes: Skills and abilities in Personal and Intellectual Autonomy.The successful student completing this Course will demonstrate socially-responsible independent thinking and take responsibility for their own actions through the application of skills and attributes described within the following themes:Medical Ethics, Legal And Professional ResponsibilitiesPersonal Professional DevelopmentGraduate attributes: Skills and abilities in Communication.The successful student completing this Course will use a range of communication skills in common clinical settings described within the following themes:The ConsultationClinical CommunicationMedical InformaticsGraduate attributes: Skills and abilities in Personal Effectiveness.The successful student completing this Course will be reflective and self-regulating, preparing for high levels of professional achievement and able to work well with others as described within the following theme:Personal Professional Development (PPD)Technical / practical skills.The successful student completing this Course will have the skills and technical abilities to permit them to function as a Foundation Doctor and postgraduate learner as described within the following themes:The ConsultationEmergency Care, Clinical and Resuscitation SkillsClinical PharmacologyTherapeuticsMedical Informatics",
    "keywords": "Psychiatry,O&G,Haem,Oncology,Breast,Pall Care,Renal,Uro,ENT,Ophthalmology,Dermatology,SSC,paediatric",
    "course_organiser": "Dr Kirsty DundasTel:(0131) 242 6509Email:Kirsty.Dundas@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MBCH11010",
    "name": "Year 6 - Preparation for Practice",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmbch11010.htm",
    "availability": "SS1",
    "period": "Full Year",
    "credits": "180",
    "subject": "MBChB",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Year 6 Undergraduate)",
    "scqf_credits": "180",
    "summary": "During Year 6 - Preparation for Practice students will become accustomed to assisting a doctor in a clinic or surgery, a ward, or operating theatre, and will become a valued member of the health-care team. By the end of the year, students will be ready to be a Foundation Doctor.The year is organised into four blocks each of 4 weeks followed by Finals exams and then a further 12 weeks for the Assistantship and Elective. There are vacations in semester 1 and 2.The attachments during Preparation for Practice are broad-based in medicine, surgery and primary care, and students will consolidate and expand their abilities to manage patients presenting with symptoms in any system, including emergencies.The Elective period forming Student Selected Component 6 offers an opportunity for special study elsewhere.During the student assistantship students will gain direct experience of working as a doctor by undertaking an apprenticeship alongside a Foundation doctor.There are opportunities for formative feedback throughout the Course.The Final Exams comprise written and practical during January/February. In addition, students are required to take formative progress tests, submit portfolio items, and complete the Assistantship and Elective satisfactorily. Students are expected to demonstrate a professional approach to their studies and conduct.",
    "course_description": "The Modules include Medicine, General Practice, Medicine of the Elderly, Surgery, Emergency Medicine, Anaesthetics, Critical Care, Assistantship and Student Selected Component 6 (medical elective).The teaching and learning experiences are varied and include: interactive lectures, large group interactive plenaries, small group tutorials, directed reading using a range of materials including online lectures and computer based learning packages, resuscitation, clinical skills and communication workshops, clinical teaching in GP surgeries, clinics, wards, operating theatres, imaging and investigative labs.Throughout Year 6 students are expected and encouraged to adopt an apprenticeship role under supervision, as much as possible. There are many opportunities to get involved in the care of patients though students must be proactive to make the most of them. There is support and guidance in the form of learning outcomes and core content as usual. In addition the learning activities for each module, such as clerking patients and completing portfolio activities indicate what is required to ensure students are competent at FY1 level by the time of graduation. There are few lectures and tutorials in Year 6, other than 'bedside' teaching, but there will be guided reading and many online resources. The portfolio case summaries continue to encourage students to explore patients' needs in depth and to synthesise and summarise these needs and clinical management succinctly to colleagues. At the end of modules tutors review evidence of performance with students and provide additional written and verbal narrative comments on general progress, with suggestions for developments.During the Assistantship, students are expected to undertake the tasks of the FY1 doctor under close supervision, to help them transfer their learning to everyday clinical practice and to gain confidence before starting work as FY1 doctors. The SSC6 (Elective) gives students an opportunity to travel and explore clinical practice in another part of the country or the world. Students are reminded not to take on tasks beyond their competence, but the exact experiences and practical work will vary depending where they choose to go.There are many other opportunities for feedback, described below. Students are expected to reflect on this feedback, discuss it with their Undergraduate Supervisors (or the Year Director) and use it to further direct and regulate their own learning.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "additional_costs": "Travel to Lothian and/or regional placements will be required. The Medical School provides a subsidy to help with these costs but they may not cover the full expenditure. Accommodation will be provided at most regional placements.Students will also need access to a smart device or laptop to submit course work.Students will be required to have their own stethoscope.",
    "academic_year": "Quota:  None",
    "course_start": "Full Year",
    "learning_activities": "Total Hours: 1800 ( Other Study Hours 579, Programme Level Learning and Teaching Hours 36, Placement Study Abroad Hours 750, Directed Learning and Independent Learning Hours 435 )",
    "assessment": {
      "written_exam_percent": 50,
      "coursework_percent": 0,
      "practical_exam_percent": 50,
      "full_text": "Written Exam\n50 %,\nCoursework\n0 %,\nPractical Exam\n50 %",
      "details": [
        "Written Exam\n50 %,\nCoursework\n0 %,\nPractical Exam\n50 %"
      ]
    },
    "assessment_formatted": "Written Exam: 50%, Practical Exam: 50%",
    "assessment_methods": "Written Exam\n50 %,\nCoursework\n0 %,\nPractical Exam\n50 %",
    "graduate_attributes_and_skills": "GRADUATE ATTRIBUTES, PERSONAL AND PROFESSIONAL SKILLSThroughout the MBChB programme, the curriculum offers challenging opportunities and support to ensure all successful students develop the University graduate attributes of Enquiry and Lifelong Learning, Aspiration and Personal Development, and Outlook and Engagement.More specifically the list below describes how the Preparation for Practice Course Learning Outcomes map to the 4 sets of Graduate Attributes and Skills, Knowledge and Understanding and Technical/Practical Skills.Knowledge and Understanding.The successful student completing this Course will apply to clinical practice, research and teaching their extensive knowledge and understanding described within the following themes:Biomedical SciencesPsychological Aspects of MedicineSocial Sciences and Public HealthPresentation, Diagnosis and ManagementClinical Pharmacology and TherapeuticsMedical Ethics, Legal and Professional ResponsibilitiesGraduate attributes: Skills and abilities in Research and Enquiry.The successful student completing this Course will apply to clinical practice, research and teaching, the skills and attributes described within the following themes:Evidence-Based Medicine and ResearchMedical InformaticsPersonal Professional DevelopmentGraduate attributes: Skills and abilities in Personal and Intellectual Autonomy.The successful student completing this Course will demonstrate socially-responsible independent thinking and take responsibility for their own actions through the application of skills and attributes described within the following themes:Medical Ethics, Legal And Professional ResponsibilitiesPersonal Professional DevelopmentGraduate attributes: Skills and abilities in Communication.The successful student completing this Course will use a range of communication skills in common clinical settings described within the following themes:The ConsultationClinical CommunicationMedical InformaticsGraduate attributes: Skills and abilities in Personal Effectiveness.The successful student completing this Course will be reflective and self-regulating, preparing for high levels of professional achievement and able to work well with others as described within the following theme:Personal Professional Development (PPD)Technical / practical skills.The successful student completing this Course will have the skills and technical abilities to permit them to function as a Foundation Doctor and postgraduate learner as described within the following themes:The ConsultationEmergency Care, Clinical and Resuscitation SkillsClinical PharmacologyTherapeuticsMedical Informatics",
    "keywords": "Medicine,Elderly,Emergency,GP,Surgery,Anaes,Critical,Elective,SSC,Assistantship",
    "course_organiser": "Dr Alix RolfeTel:(0131 6)51 4362Email:Alix.Rolfe@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MEED11035",
    "name": "Adopting quality improvement methodology approaches to clinical education",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11035.htm",
    "availability": "SS1",
    "period": "Flexible",
    "credits": "40",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "40",
    "summary": "Quality improvement is increasingly a core component of many undergraduate and postgraduate curricula. Numerous healthcare organisations, professional regulators, and policy makers recognise the benefits of training clinicians in quality improvement.In order to thrive in an increasingly challenging healthcare environment, the ability of clinicians to undertake work-based quality improvement projects is more important than ever for healthcare systems' continued survival.This course offers students the opportunity to critically study and systematically examine the methods and factors that best work to facilitate quality improvement approaches.Students will develop a QI project proposal to manage change in the most effective way within their own healthcare setting.The underlying research around QI principles, cultures, approaches, and methods are explored to help students to consider how best to improve quality of educational practice in their setting.Online environments are used for the teaching, learning and assessment of all courses on the programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "course_description": "The course aims to provide students the opportunity to study the methods and processes that could be used to critique, analyse, and improve educational quality within healthcare. At the end of the course, individuals will have the knowledge and skills to design, develop and lead on improvement projects, generate support for change and provide credible support and advice.A culture of enthusiasm, optimism, curiosity, and critical thinking is encouraged throughout the course. Students will be encouraged to share the development of their plan and learn with, and from, each other.The course will also support the students to focus on the practical application of what they learn from the course into their professional practice. Exploring the role and impact of clinical education and the management and leadership requirements to support Quality Improvement will form a key elements of the course content.The course is delivered online using live conversations, discussion boards, reflective tasks and online resources. It also draws on self-directed and peer learning. A workbook will be provided for students to work through as the course progresses, this will enable those with poor access to the Internet to download the workbook and study at times of poor connectivity.Core themes will be discussed throughout the course and built upon through a progressive learning approach that will require the learners to use and develop critical thinking and problem-solving skills.Themes that are covered include:- Defining quality and understanding core improvement concepts.- The planning and application of improvement projects.- Utilising improvement science tools and frameworks.- Measuring improvement.- Leadership and governance.- Using and learning from data (clinical audits).- Teaching and supporting individuals/teams in QI approaches.",
    "pre_requisites": "Critical Literature Review (MEED11036)",
    "prerequisites": "Critical Literature Review (MEED11036)",
    "prohibited_combinations": "",
    "additional_costs": "None",
    "academic_year": "Quota:  None",
    "course_start": "05/08/2024",
    "learning_activities": "Total Hours: 400 ( Lecture Hours 10, Seminar/Tutorial Hours 20, Feedback/Feedforward Hours 2, Formative Assessment Hours 10, Summative Assessment Hours 50, Programme Level Learning and Teaching Hours 8, Directed Learning and Independent Learning Hours 300 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Personal and intellectual autonomy: This course will further develop the mindset and skills of the students to practically apply their academic learning and new knowledge to their profession or institution. It will also promote personal independent learning and development.Inquiry and lifelong learning: Academic staff and learners will work together to co-create an enquiry-based community that emphasises the studentÂ¿s active role in the learning process to make positive and on-going change.Outlook and engagement: The establishment of a supportive learning environment will encourage students to engage with the themes and question assumptions around the current practice and consider how QI processes can best support enhancement. The course will allow students to develop their way of thinking around the topic of QI, be encouraged to pursue their ideas to improve service delivery within their setting using innovative approaches.Aspiration and personal development: Underpinning this approach will be a practice of curiosity, critical thinking and creativity that will allow the students to be effective and influential contributors in improvement processes within the workplace.Personal effectiveness: Students will be in a position to recognise the ideologies, coordinate strategies, and influence mechanisms of collective decision-making as part of healthcare service redesign that may have the potential to impact on service delivery and patient safety.Communication: Identifying change needs and considering how to plan and communicate the QI process along with measuring the impact and effect of this, will form part of the aims of this course.Research and enquiry: This will further develop the studentsÂ¿ abilities to formulate, evaluate, adapt, and apply evidence-based solutions and arguments through the use of QI tools research and methods with a reasoned perspective.",
    "keywords": "Quality,Improvement,enhancement,assurance,educational project management,leadership,change,planning",
    "course_organiser": "Ms Lynsey CampbellTel:Email:ldownie@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MEED11030",
    "name": "Agile course design for professional education",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11030.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "This course combines theory and practice in supporting students to design a course that is underpinned by key pedagogical principles, irrespective of whether it is primarily online, on-campus, blended, or a hybrid model. By framing education as never fully digital nor fully on-campus, we will encourage students to think beyond simple binaries and methods and consider the possibilities and limitations of agile course design. Among other things, this perspective requires students to: examine the complex contexts in which their own learners learn; the ways in which physical, digital, and social elements combine in learning and teaching activities; and what that means for planning and delivering courses.",
    "course_description": "This course is primarily driven by the process of designing a course for a specialist professional area. This might be an actual course that will run with real students but will also be of benefit as a hypothetical exercise. The course is structured as a series of practical activities that you will undertake as part of a course design process and documentation. Activities will also include reflection and dialogue with tutors and fellow students about design theories and considerations of the aims and context of your own course, as well as of those of your peers.Each week, the activities will form part of a design template that will eventually be submitted as a key component of the assignment, along with a theoretical rationale and reflective account. Tutor and peer feedback will be provided on these activities throughout the course.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "graduate_attributes_and_skills": "Enquiry and lifelong learningAspiration and personal developmentOutlook and engagementResearch and enquiryPersonal and intellectual autonomyPersonal effectivenessCommunication",
    "keywords": "Course design,curriculum,agile,postdigital,learning environment,online learning",
    "course_organiser": "Dr Tim FawnsTel:0131 242 6536Email:T.Fawns@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 0,
      "practical_exam_percent": 0,
      "full_text": "School"
    },
    "assessment_formatted": "",
    "assessment_methods": "School",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MEED11022",
    "name": "Assessment, Examinations and Standard Setting",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11022.htm",
    "availability": "SV1",
    "period": "Semester 2",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "This course forms part of the Clinical Education programme and deals with assessment, feedback and associated topics for both undergraduate and postgraduate students.Assessment in healthcare must be robust enough to protect patients, and reassure other stakeholders by permitting only competent candidates to progress without inadvertently holding back others who are also able.  This is an enormous challenge especially when endeavouring to assess the wide range of competencies and attributes that we expect healthcare professionals to demonstrate.  In addition there is a complex interplay between learning, assessment and feedback, making it difficult to predict exactly how effective assessments will be in any one context.During this course, students will have weekly online lectures, live conversations and discussion boards to guide and support their learning.  The focus is on principles of good assessment as they relate to the range of methods used within healthcare across the world.  As the course progresses, students will increasingly be able to critique and apply the literature to issues of assessment design.",
    "course_description": "During this course students will explore the following topics:- purposes of assessment- formative and summative assessments- current key issues in assessment and academic feedback- common modes, methods and processes of assessment- reliability, validity, cost-effectiveness, educational impact, utility, and fairness - evaluating and establishing quality- planning assessment in the clinical context- peer and group assessmentStudents will be provided with a variety of materials to read, listen to and consider, as well as opportunities to nurture, extend and challenge their own understanding through live, online conversations and asynchronous discussion boards.Online environments are used for the teaching, learning and assessment of all courses on the programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive, visual, audio, textural and graphical modes of communication.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "academic_year": "Quota:  None",
    "course_start": "13/01/2025",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Seminar/Tutorial Hours 8, Online Activities 65, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 83 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Not entered",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "Not entered",
    "course_organiser": "Ms Lynsey CampbellTel:Email:ldownie@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MEED11024",
    "name": "Clinical Education and Digital Culture",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11024.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "This course helps participants to gain critical awareness of  technology's contribution to the learning, teaching, training and practice environment, and invites reflection and evaluation of what it means to be a clinical educator and practitioner within a highly digitalised culture.The overarching approach will be to frame questions currently relevant within the general domain of study and invite critical engagement, reflection and considered response through tutorials, discussion boards and a blog. This dialogic approach is in keeping with a need to respond to emerging issues as well as aligning with and providing experience of recent developments in digital education. As such, tutorials will be expected to run as group discussions with debate around issues relevant to the lecture, rather than a Q & A session with the lecturer.Please note that, as a second year course, this will involve greater self-direction than first year courses. Students will play a greater role in directing discussions and finding appropriate resources to make use of and discuss with peers.Online environments are used for the teaching, learning and assessment of all courses on the programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "course_description": "- Data (data capitalism, security, mobility).- Digital professionalism (personal/professional boundaries, ownership, representation).- Web 2.0 (social media, federated content, student-created learning environments, data ownership).- The Open Web (Open source, open educational resources, OpenData, equality and accessibility).- \"Politics of technology\" an introduction to some of the technology-related agendas that clinical educators deal with, such as service provision and commercialisation, issues of affordances and technological determinism.- Media literacy - digital footprints, digital professionalism, data protection, appraisal of sources, information overload, digital natives discourse.- The Virtual and the Real (simulation, virtual patients, what can and cannot, should and should not be mediated online).- The Future (emerging technologies and trends, mobile technology, wearable technology, point of care assistance, eHealth, the memory prosthesis debate, student/patient expectations, rights and self-management).",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "graduate_attributes_and_skills": "Not entered",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "digital professionalism,social media,web 2.0,technology",
    "course_organiser": "Dr Jess GurneyTel:0131 242 6536Email:Jess.Gurney@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 0,
      "practical_exam_percent": 0,
      "full_text": "School"
    },
    "assessment_formatted": "",
    "assessment_methods": "School",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MEED11036",
    "name": "Critical Literature Review",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11036.htm",
    "availability": "SS1",
    "period": "Semester 1",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "This course affords students the opportunity to undertake and complete an in-depth critical review of literature pertaining to a 'problem' or chosen topic. Throughout the course, the critical literature review process is examined in order that students refine their research topic, while learning to systematically search for, collate, critically analyse, organise, and synthesise literature pertaining to it. To promote reflexivity, the assessment will also have a reflective component.Through this course, students further develop the knowledge and skills to locate, critically examine and critically interpret evidence. The course supports the development of skills needed to both articulate a knowledge gap and design a strategy to address the gap. Furthermore, flourishing in an increasingly complex health and social care environment, requires developing the knowledge and skills to inform practice continuously by applying best available evidence, as well as dealing with uncertainties.Online environments are used for the teaching, learning and assessment of all courses on the programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "course_description": "The course provides students the opportunity to critically examine the methods and processes used to identify, search for, collate, critically analyse, and synthesise literature pertaining to an identified research topic. At the end of the course, students will have the knowledge and skills to design, develop, and report on a critical literature review and to critically reflect on their own learning.A culture of enthusiasm, optimism, curiosity, critical thinking and critical reflection is encouraged throughout the course. Students are encouraged to share the development of their critical literature review and learn with, and from, each other.The course also supports students to focus on the practical application of what they learn from the course into their professional practice. Exploring the role and impact of clinical education and the management and leadership requirements to support evidence informed practice forms elements of the course content.The course is delivered online using live conversations, discussion boards, reflective tasks, online resources, and self-directed and peer learning. A downloadable workbook is provided for students to work through as the course progresses. This also enables those with internet access issues to study offline.Core themes will be discussed throughout the course and built upon through a progressive learning approach which requires participants to develop and apply critical thinking and problem-solving skills.Themes that are covered include:- Defining a research topic for investigation through critical literature review.- Examining and identifying a methodological framework for critical literature review.- Designing and implementing a systematic search strategy for retrieving relevant literature.- Data management, including management of bibliographic records and of data extraction.- Critically analysing and appraising retrieved research articles.- Synthesising evidence in relation to the identified problem.- Writing a structured critical literature review report.- Critically reflecting on learning in relation to critical literature review.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "academic_year": "Quota:  100",
    "course_start": "16/09/2024",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 10, Seminar/Tutorial Hours 10, Online Activities 60, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 84 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "As an overview, the course enhances learning for an already motivated student group of health and social care professionals who demonstrate the values required of a clinical educator. The incentive of improving care and safety through excellence in education is a key inspiration of the student(s) who enrol on the course.The content and format of the course further enhances these qualities by developing a culture that is supportive to allow learners to question assumptions around critical literature review that may be limiting their professional development.Creating a 'safe space' that encourages learners to find ways of overcoming challenges a reality through curiosity, critical thinking and creativity will underpin the course.",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "Literature review,critical appraisal,evidence synthesis,data management",
    "course_organiser": "Ms Janette JamiesonTel:(0131) 242 6419Email:Janette.Jamieson@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MEED11037",
    "name": "Current Issues in Simulation Based Education",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11037.htm",
    "availability": "SV1",
    "period": "Semester 2",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "This course is aimed at experienced practising healthcare professionals with an educational remit within Simulation. The aim of the course is to allow students to undertake an in depth study into a topical area of their choice which relates to simulation based education. The course will allow students to develop their research skills, produce an informed, evidence-based position paper and engage in academic debate. This process will allow students to consider the role of education in improving practice and more general benefits to society.  Whilst it will be the students' choice, it is envisaged topics may include interprofessional education, social inclusion, stakeholder engagement, MOOCs or widening access.",
    "course_description": "Please note that as a final course on the PgCert in Simulation in Healthcare Education this course will involve greater self-direction than earlier courses. Students will play a greater role in directing discussions and finding appropriate resources to make use of and discuss with peers.Online environments are used for the teaching, learning and assessment of all courses on the programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "academic_year": "Quota:  21",
    "course_start": "Semester 2",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Seminar/Tutorial Hours 8, Online Activities 65, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 83 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "This course will help students develop the following graduate attributes and skills:Enquiry and lifelong learning, aspiration and personal development, outlook and engagement, research and enquiry, personal and intellectual autonomy, personal effectiveness, communication.",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "Simulation Based Education,SBE,Clinical or Medical Education,Interprofessional Education",
    "course_organiser": "Ms Janette JamiesonTel:(0131) 242 6419Email:Janette.Jamieson@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MEED11025",
    "name": "Current issues in clinical education",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11025.htm",
    "availability": "SS1",
    "period": "Semester 2",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "This course is aimed at experienced practising healthcare professionals with an educational remit. The aim of the course is to allow students to undertake an in depth study into a topical area of their choice in clinical education.  The course will allow students to develop their research skills, produce an informed, evidence-based position paper and engage in academic debate.This process will allow students to consider the role of education in improving practice and more general benefits to society.Whilst it will be the students' choice, it is envisaged topics may include inter-professional education, social inclusion, stakeholder engagement, MOOCs or widening access.",
    "course_description": "Please note that, as a second year course, this will involve greater self-direction than first year courses. Students will play a greater role in directing discussions and finding appropriate resources to make use of and discuss with peers.Online environments are used for the teaching, learning and assessment of all courses on the programme.  This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "academic_year": "Quota:  100",
    "course_start": "13/01/2025",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Seminar/Tutorial Hours 8, Online Activities 65, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 83 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Not entered",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "Not entered",
    "course_organiser": "Ms Janette JamiesonTel:(0131) 242 6419Email:Janette.Jamieson@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MEED11028",
    "name": "Dissertation (Clinical Education - 1 Year Full-Time)",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11028.htm",
    "availability": "",
    "period": "Not delivered this year",
    "credits": "60",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "60",
    "summary": "This will be an original piece of work that demonstrates the ability to undertake a scholarly investigation into an issue relating to Clinical Education. This can also take the form of a paper for publication, in addition to a supporting commentary document.This course is only available to those studying a one year programme.",
    "course_description": "The dissertation is designed to further develop the student's academic skills and ability to obtain and interrogate research data to provide further insights in the clinical education field. The dissertation project is designed to further develop the student's understanding of the processes and planning involved in undertaking research and to develop their academic writing skills.Before beginning, a detailed proposal must be submitted and approved by the programme team. Each student will be allocated a supervisor for the duration of the dissertation. As with all courses on this programme, students will be encouraged to research an area of direct interest to their professional role.",
    "pre_requisites": "No Prerequisites",
    "prerequisites": "No Prerequisites",
    "prohibited_combinations": "",
    "graduate_attributes_and_skills": "This dissertation directly addresses the following graduate attributes:Research and enquiryCommunicationPersonal effectiveness",
    "special_arrangements": "Online environments are used for the teaching, learning and assessment of all courses on the MSc programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "keywords": "Research,clinical education,dissertation",
    "course_organiser": "Dr Jane HislopTel:Email:Jane.Hislop@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 0,
      "practical_exam_percent": 0,
      "full_text": "School"
    },
    "assessment_formatted": "",
    "assessment_methods": "School",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MEED11021",
    "name": "Dissertation (Clinical Education)",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11021.htm",
    "availability": "SS1",
    "period": "Flexible",
    "credits": "60",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "60",
    "summary": "This will be an original piece of work that demonstrates the ability to undertake a scholarly investigation into an issue relating to Clinical Education.  This can also take the form of a paper for publication, in addition to a supporting commentary document.",
    "course_description": "The dissertation is designed to further develop the student's academic skills and ability to obtain and interrogate research data to provide further insights in the clinical education field. The dissertation project is designed to further develop the student's understanding of the processes and planning involved in undertaking research and to develop their academic writing skills.Before beginning, a detailed proposal must be submitted and approved by the programme team. Each student will be allocated a supervisor for the duration of the dissertation. As with all courses on this programme, students will be encouraged to research an area of direct interest to their professional role.",
    "pre_requisites": "No Prerequisites",
    "prerequisites": "No Prerequisites",
    "prohibited_combinations": "",
    "academic_year": "Quota:  None",
    "course_start": "16/09/2024",
    "learning_activities": "Total Hours: 600 ( Lecture Hours 10, Seminar/Tutorial Hours 15, Dissertation/Project Supervision Hours 20, Online Activities 24, Feedback/Feedforward Hours 5, Formative Assessment Hours 10, Summative Assessment Hours 54, Programme Level Learning and Teaching Hours 12, Directed Learning and Independent Learning Hours 450 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Not entered",
    "special_arrangements": "Online environments are used for the teaching, learning and assessment of all courses on the MSc programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "keywords": "Not entered",
    "course_organiser": "Dr Jane HislopTel:Email:Jane.Hislop@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MEED11029",
    "name": "Personal and Professional Development for Practice",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11029.htm",
    "availability": "SV1",
    "period": "Semester 2",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "This course aims to explore personal and professional development for clinicians/practitioners within clinical and educational contexts and roles.Participants will reflect on their own development and educational needs both as a clinician/practitioner and as an educator. They will consider the rationale for personal professional development (PPD) and its impact upon the needs of the organisation, colleagues, students and their own career progress.  The impact of these PPD components upon patient care will also be considered.Participants will contextualise PPD, examine the factors which might influence an individual's engagement with the process and consider support strategies.Online environments are used for the teaching, learning and assessment of all courses on the Clinical Education programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "course_description": "Please note that, as a second year course, this will involve greater self-direction than first year courses. Students will play a greater role in directing discussions and finding appropriate resources to make use of and discuss with peers.This course will be comprised of a set of themes, supported by live online conversations and asynchronous discussion forums.  Live conversations will include guest speakers, small group work and group discussions around weekly tasks.Workbooks, teaching resources, relevant literature and articles will be posted on the Blackboard Learn Virtual Learning Environment.Participants will be required to reflect upon and map their career trajectory from graduation to a point in the future, before designing a final PPD plan.The reflective account and PPD plan will form the basis of the assessment tasks of this course.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "academic_year": "Quota:  None",
    "course_start": "01/02/2025",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Seminar/Tutorial Hours 8, Online Activities 65, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 83 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Participants can expect to develop an increased appreciation of the factors which might impact upon staff development. By reflecting upon the tools and processes used to support an individual's personal and professional development, participants can enhance skills used for their personal development and that of their juniors, colleagues and wider team.Knowledge and skills from this unit may be applied to create educational solutions to issues within their workplace.",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "Personal development,professional development,PPD,CPD",
    "course_organiser": "Ms Veronica DaveyTel:0131 242 6130Email:vdavey@exseed.ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MEED11020",
    "name": "Policy, Leadership, Management and Evaluation",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11020.htm",
    "availability": "SV1",
    "period": "Semester 2",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "The course will engage with some general concepts about policy, leadership and change management with a view to exploring their significance in determining the nature and quality of clinical education. The concepts and examples chosen will enable the student to understand the nature of the educational circumstances in which they work, and will enable them to apply some of the core skills in their own education practice. Specific examples include the importance of governing bodies, such as the GMC and international equivalents. Due consideration will be given to the broad political context of policy making and how this impacts on delivery of healthcare and the work of health professionals. We will explore the value of different approaches to leadership and change management in the context of delivering service improvement relevant to clinical education. The topics covered will reflect emerging policy issues so will include, but not be restricted to,- The definition, development and implementation of policy- Leadership theories and styles and their relevance to clinical education- Approaches to change management and their application in the context of service improvement",
    "course_description": "Please note that, as a second year course, this will involve greater self-direction than first year courses. Students will play a greater role in directing discussions and finding appropriate resources to make use of and discuss with peers.Online environments are used for the teaching, learning and assessment of all courses on the programme.  This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "academic_year": "Quota:  100",
    "course_start": "13/01/2025",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Seminar/Tutorial Hours 8, Online Activities 65, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 83 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Not entered",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "Not entered",
    "course_organiser": "Dr Jane HislopTel:Email:Jane.Hislop@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MEED11013",
    "name": "Principles of Teaching and Learning",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11013.htm",
    "availability": "SV1",
    "period": "Semester 1",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "The aim of the programme is to promote high quality clinical education by helping participants reflect upon, and share insights about their practice; to understand and apply educational theories and evidence from the literature and to help participants develop a good solid foundation in clinical education and educational research upon which they can continue to build their own academic career.",
    "course_description": "This course is designed to encourage students to consider the learner, the teacher and the educational environment and how these factors interact.Online environments are used for the teaching, learning and assessment of all courses on the programme.  This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "academic_year": "Quota:  200",
    "course_start": "16/09/2024",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Seminar/Tutorial Hours 8, Online Activities 65, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Revision Session Hours 3, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 80 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Not entered",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "additional_class_delivery_information": "All courses to be delivered by online learning.",
    "keywords": "Not entered",
    "course_organiser": "Ms Veronica DaveyTel:0131 242 6130Email:vdavey@exseed.ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MEED11023",
    "name": "Quantitative Research in Clinical Education",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11023.htm",
    "availability": "SS1",
    "period": "Blocks 2-3 (Sem 1-2)",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "Quantitative research - generally involving detailed statistical analysis of large amounts of data - is increasingly important in medical education. However, medical educators frequently lack the background necessary to evaluate research using such data or to apply such techniques in their own work. This course is designed to provide educators with the necessary skills to understand quantitative research and apply it in their host institutions.",
    "course_description": "Online environments are used for the teaching, learning and assessment of all courses on the MSc programme. This includes the Waverley Suite, allowing interactive visual, audio, textural and graphical modes of communication, in the same synchronous or asynchronous event.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "academic_year": "Quota:  None",
    "course_start": "01/11/2024",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Online Activities 50, Feedback/Feedforward Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 107 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Not entered",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "Quantitative research,clinical education,statistics,educational research",
    "course_organiser": "Mr David HopeTel:Email:David.Hope@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Series of lectures and studio workshops\n• Introduction to various art and design disciplines\n• Develop basic skills in research, ideation, and design development"
  },
  {
    "code": "MEED11017",
    "name": "Research in Clinical Education",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11017.htm",
    "availability": "SV1",
    "period": "Semester 1",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "This course will address the conduct of research in clinical education; it will enable the student to be an engaged consumer of research and prepare those progressing to completion of a research project and award of the MSc in Clinical Education.More specifically the following areas will be considered:- Research in clinical education: issues and challenges- An overview of the research process- Research or evaluation?- Generating a research question- Selecting a methodology- Ethical issues in researching clinical education- Locating and appraising the literature- Qualitative methodologies and quantitative designs- Systematic reviews and qualitative evidence synthesis- Commonly used methods- Approaches to analysis (qualitative and quantitative)- Writing a research report and writing for publication",
    "course_description": "Please note that, as a second year course, this will involve greater self-direction than first year courses. Students will play a greater role in directing discussions and finding appropriate resources to make use of and discuss with peers.Online environments are used for the teaching, learning and assessment of all courses on the programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "academic_year": "Quota:  None",
    "course_start": "16/09/2024",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Seminar/Tutorial Hours 8, Online Activities 65, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 83 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Not entered",
    "special_arrangements": "There are limited places to take this course as an outside course and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "Not entered",
    "course_organiser": "Dr Jane HislopTel:Email:Jane.Hislop@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MEED11027",
    "name": "Simulation Methodology for Clinical Education",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11027.htm",
    "availability": "SV1",
    "period": "Blocks 2-3 (Sem 1-2)",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "The aim of this course is to develop participants from a novice to a competent/proficient facilitator in utilising clinical simulation as a learning tool.Please note that this course will involve greater self-direction than some other courses. Students will play a greater role in directing discussions and finding appropriate resources to make use of and discuss with peers.",
    "course_description": "Through this course students will apply relevant learning theory and a range of simulation based learning modalities to create simulation based scenarios/programmes that engage learners, influence practice, and ultimately improve patient safety and quality of care.Online environments are used for the teaching, learning and assessment of all courses on the programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.Students will have weekly live conversations and asynchronous discussion forums to guide and support their learning. The weekly live conversations will be interactive and consist of a mix of short presentations, small group work, debates, and group discussions.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "additional_costs": "Travel as required to observe and deliver simulation scenarios, given online delivery of the course it is likely these will be minimal as the assessment is designed to be undertaken in the students' individual workplace.",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "academic_year": "Quota:  None",
    "course_start": "21/10/2024",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Seminar/Tutorial Hours 8, Online Activities 65, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 83 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Participants can expect to develop an increased appreciation of lifelong learning and enquiry over the unit. Additionally, by focusing on reflection and debriefing method, participants will be able to utilise the same skills in every part of their professional and personal lives.The unit will enhance the participants' communication skills as debriefers and educators and influence their personal effectiveness and confidence in being able to apply the skills and knowledge from this unit into creating educational solutions in their workplace.",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "additional_class_delivery_information": "All courses to be delivered by distance learning.",
    "keywords": "Simulation,clinical education,debriefing,course design",
    "course_organiser": "Dr Stephen MeldrumTel:0131 242 6536Email:S.Meldrum@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MEED11034",
    "name": "Teaching online in a professional context",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11034.htm",
    "availability": "SV1",
    "period": "Blocks 2-3 (Sem 1-2)",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "This course introduces online key strategies for online teaching. It considers the development of approaches to teaching online and relates these to relevant educational theory. The course is designed to allow students to make explicit links to their own professional practice, conceptualising online learning as a socially meaningful, embodied experience.",
    "course_description": "Please note that, as a second year course, this will involve greater self-direction than first year courses. Students will play a greater role in directing discussions and finding appropriate resources to make use of and discuss with peers.The course will be delivered online to educators working in a variety of professional contexts with significant responsibility for teaching students (or others in a training post). Course content will include: approaches to online teaching, critical appraisal of evidence for the effectiveness of online learning, strategies for developing community and student engagement, assessment, equality and diversity in teaching online, developing autonomy, teacher identity and authenticity. The course, by design, will focus on building an academic community, allowing students to share experiences, establish shared understanding, and make explicit links between the pedagogy of online teaching, their profession, and professional workplace.Online environments are used for the teaching, learning and assessment of all courses on the programme. This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "academic_year": "Quota:  100",
    "course_start": "21/10/2024",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Seminar/Tutorial Hours 8, Online Activities 65, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 83 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Enquiry and lifelong learningAspiration and personal developmentOutlook and engagementResearch and enquiryPersonal and intellectual autonomyPersonal effectivenessCommunication",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "Professional education,online teaching,student engagement",
    "course_organiser": "Dr Jess GurneyTel:0131 242 6536Email:Jess.Gurney@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "MEED11014",
    "name": "The Curriculum",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxmeed11014.htm",
    "availability": "SV1",
    "period": "Blocks 2-3 (Sem 1-2)",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Edinburgh Medical School",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "The course will consider the nature of curricula, curriculum design and its impact upon teaching and learning. Theoretical underpinnings will be considered and their application in practice discussed.Evidence from the literature and relevant policy will support learners' analysis of their practice within their context. For example:- International policy, recommendations and guidelines (eg WHO, European guidelines)-  Recommendations and guidelines at national level (E.G. GMC, NMC, GDA, Royal Colleges, and government agencies).-  The explicit and hidden curriculum-  Educational theories and current practices (eg constructive alignment)Participants are encouraged to reflect upon current practice to explore the strengths and limitations of educational approaches such as competency-based education.",
    "course_description": "Online environments are used for the teaching, learning and assessment of all courses on the programme.  This includes Microsoft Teams for regular, synchronous conversations, a virtual learning environment with discussion forums for asynchronous dialogue, and other interactive visual, audio, textural and graphical modes of communication.",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "visiting_prerequisites": "None",
    "high_demand": "Yes",
    "academic_year": "Quota:  None",
    "course_start": "01/11/2024",
    "learning_activities": "Total Hours: 200 ( Lecture Hours 8, Seminar/Tutorial Hours 8, Online Activities 65, Feedback/Feedforward Hours 1, Formative Assessment Hours 1, Summative Assessment Hours 30, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 83 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Not entered",
    "special_arrangements": "There are limited places to take this course as an outside elective and students not on the Clinical Education programme wishing to enrol, should first contact the Course Secretary to ascertain availability. Email: clinicaleducation@ed.ac.uk",
    "keywords": "Not entered",
    "course_organiser": "Ms Janette JamiesonTel:(0131) 242 6419Email:Janette.Jamieson@ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  },
  {
    "code": "EDUA11310",
    "name": "Clinical Education and Academic Practice",
    "url": "http://www.drps.ed.ac.uk/24-25/dpt/cxedua11310.htm",
    "availability": "SS1",
    "period": "Full Year",
    "credits": "20",
    "subject": "Medical Education",
    "school_name": "Edinburgh Medical School",
    "college": "College of Medicine and Veterinary Medicine",
    "full_title": "DEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025",
    "": "THE UNIVERSITY of EDINBURGHDEGREE REGULATIONS & PROGRAMMES OF STUDY 2024/2025Timetable information in the Course Catalogue may be subject to change.",
    "school": "Moray House School of Education and Sport",
    "credit_level": "SCQF Level 11 (Postgraduate)",
    "scqf_credits": "20",
    "summary": "This course aims to practically develop the skills of those teaching and assessing medical students. Through involvement in workshops, online modules, teaching observation & feedback sessions and individual/pair/group reflection exercises, participants will be introduced to core educational theory and given the opportunity to hone their educational skills and creativity. Through facilitated discussion and group networking, participants will develop a number of diverse teaching sessions which they can put into practice and evaluate with students or with trainees in their workplace.",
    "course_description": "Not entered",
    "pre_requisites": "",
    "prerequisites": "",
    "prohibited_combinations": "",
    "additional_costs": "n/a",
    "academic_year": "Quota:  None",
    "course_start": "16/09/2024",
    "learning_activities": "Total Hours: 200 ( Seminar/Tutorial Hours 14, Online Activities 9, Feedback/Feedforward Hours 5, Other Study Hours 1, Programme Level Learning and Teaching Hours 4, Directed Learning and Independent Learning Hours 167 )",
    "assessment": {
      "written_exam_percent": 0,
      "coursework_percent": 100,
      "practical_exam_percent": 0,
      "full_text": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
      "details": [
        "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %"
      ]
    },
    "assessment_formatted": "Coursework: 100%",
    "assessment_methods": "Written Exam\n0 %,\nCoursework\n100 %,\nPractical Exam\n0 %",
    "graduate_attributes_and_skills": "Not entered",
    "keywords": "medical education; academic practice",
    "course_organiser": "Mr Ian LeeTel:Email:ilee@exseed.ed.ac.uk",
    "navigationhelp_&_informationhomeintroductionglossarysearch_dpts_and_coursesregulationsregulationsdegree_programmesintroductionbrowse dptscoursesintroductionhumanities_and_social_sciencescience_and_engineeringmedicine_and_veterinary_medicineother_informationcombined_course_timetableprospectusesimportant information": "Navigation",
    "bulletpoints": "• Taught through parallel design Studios with distinctive sub-themes\n• Research and investigate technological themes for architectural exploration\n• Culminates in architectural design proposal for a specific site and program"
  }
]